[{"title":"xxxxxxx","url":"http://localhost:9090/submit","text":"xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"},{"title":"rrrrrr","url":"http://localhost:9090/submit","text":"http://localhost:9090/submithttp://localhost:9090/submithttp://localhost:9090/submit"},{"title":"43241432421324132","url":"http://war.163.com/photoview/4t8e0001/2266409.html","text":"\tleave url blank to submit a question for discussion. if there is no url, the text (if any) will appear at the top of the thread.\r\n\r\nyou can also submit via bookmarklet.\tleave url blank to submit a question for discussion. if there is no url, the text (if any) will appear at the top of the thread.\r\n\r\nyou can also submit via bookmarklet.\tleave url blank to submit a question for discussion. if there is no url, the text (if any) will appear at the top of the thread.\r\n\r\nyou can also submit via bookmarklet."},{"title":"querystring.parse(str[, sep[, eq[, options]]])","url":"https://nodejs.org/dist/latest-v6.x/docs/api/querystring.html#querystring_querystring_parse_str_sep_eq_options","text":"Added in: v0.1.25\r\nstr <String> The URL query string to parse\r\nsep <String> The substring used to delimit key and value pairs in the query string. Defaults to '&'.\r\neq <String>. The substring used to delimit keys and values in the query string. Defaults to '='.\r\noptions <Object>\r\ndecodeURIComponent <Function> The function to use when decoding percent-encoded characters in the query string. Defaults to querystring.unescape().\r\nmaxKeys <number> Specifies the maximum number of keys to parse. Defaults to 1000. Specify 0 to remove key counting limitations.\r\nThe querystring.parse() method parses a URL query string (str) into a collection of key and value pairs.\r\n\r\nFor example, the query string 'foo=bar&abc=xyz&abc=123' is parsed into:"},{"title":"今天天气很凉爽","url":"http://localhost:9090/submit","text":"因为有空调。。。"},{"title":"first news","url":"http://localhost:9090/submit","text":"first newsfirst newsfirst newsfirst newsfirst newsfirst newsfirst newsfirst newsfirst newsfirst news","id":5},{"title":"sec news","url":"http://localhost:9090/submit","text":"sec newssec newssec newssec newssec newssec newssec newssec news","id":6},{"title":"Shared knowledge for the Open Web","url":"https://developer.mozilla.org/en-US/","text":"Web API reference\r\n\r\nThe Web offers a wide variety of APIs to perform various useful tasks. These can be accessed using JavaScript code, and let you do anything from making minor adjustments to any window or element, to generating intricate graphical and audio effects using APIs such as WebGL and Web Audio.\r\n\r\nEach individual interface across all APIs is listed in the index.\r\n\r\nThere's also a listing of all available events in the event reference.\r\n\r\nDocument Object Model\r\nThe DOM is an API that allows access to and modification of the current document. It allows manipulation of document Node and Element. HTML, XML and SVG have extended it to manipulate their specific elements.\r\nDevice APIs\r\nThis set of APIs allows access to various hardware features available to Web pages and applications. E.g. Ambient Light Sensor API, Battery Status API, Geolocation API, Pointer Lock API, Proximity API, Device Orientation API, Screen Orientation API, Vibration API.\r\nCommunication APIs\r\nThese APIs let Web pages and applications communicate with other pages or devices. E.g. Network Information API, Web Notifications, Simple Push API.\r\nData management APIs\r\nUser data can be stored and managed using this set of APIs. E.g. FileHandle API, IndexedDB.\r\nIn addition to these APIs that are available to any Web site or app, a set of more powerful Mozilla APIs are available to privileged and certified applications.\r\n\r\nPrivileged APIs\r\nA privileged application is an installed app that has been given specific rights by the user. Privileged APIs include: TCP Socket API, Contacts API, Device Storage API, Browser API, Camera API.\r\nCertified APIs\r\nA certified application is a low-level application performing critical operations in an operating system like Firefox OS. Less privileged application interact with these applications using Web Activities.  Certified APIs include: Bluetooth API, Mobile Connection API, Network Stats API, Telephony, WebSMS, WiFi Information API, Power Management API, Settings API, Idle API, Permissions API, Time/Clock API.","id":7}]